print('Привет!')
while True:
    print(f"Выбери уровень:  1, 2, 3, 4 или 5 -> \nДля окончания программы введи 0.")
    uroven = int(input())

    if uroven == 0:
        print(f"Пока!")
        break

    if uroven == 1:
        print( f"Описание уровня:\nМетод 1: upper() - Делает все буквы в строке заглавными.\nМетод 2: lower() - Делает все буквы в строке строчными.\nМетод 3: capitalize() - Делает первую букву в строке заглавной.\n")
        text1 = "пРиВет МИР!"
        print(f"Проведем тест на строке '{text1}':\nРезультат метода 1: {text1.upper()} <- Все буквы строки стали заглавными.\nРезультат метода 2: {text1.lower()} <- Все буквы строки стали строчными.\nРезультат метода 3: {text1.capitalize()} <- Первая буква строки стала заглавной, а остальные строчными.\n")
        met = int(input("Выбери метод: "))
        if met == 1:
            v1 = str(input("Введи строку: "))
            print("Результат: ", v1.upper())
        elif met == 2:
            v2 = str(input("Введи строку: "))
            print("Результат: ", v2.lower())
        elif met == 3:
            v3 = str(input("Введи строку: "))
            print("Результат: ", v3.capitalize())
        else:
            print("Ошибка")

    elif uroven == 2:
        print(f"Описание уровня:\nМетод 1: find() - Ищет какой-то символ/слово в строке и выводит его первый индекс.\nМетод 2: replace() - Заменяет символ в строке на другой.\nМетод 3: count() - Считает количество символов в строке.\n")
        text2 = "Ботать это круто. Очень круто"
        print(f"Проведем тест на строке '{text2}':\nРезультат метода 1: {text2.find("круто")} <- Первый индекс слова 'круто' - 11 (буква к).\nРезультат метода 2: {text2.replace("круто", "+")} <- Слово 'круто' заменяется на знак '+'.\nРезультат метода 3: {text2.count("о")} <- В строке 'Ботать это круто' символ 'о' встречается 4 раза.\n")
        met = int(input("Выбери метод: "))
        if met == 1:
            v1 = str(input(f"Введи строку: "))
            s1 = str(input(f"Введи символ/слово, первый индекс котрого хочешь узнать: "))
            print("Результат: ", v1.find(s1))
        elif met == 2:
            v2 = str(input(f"Введи строку: "))
            s2 = str(input(f"Введи символ/слово, который ты хочешь заменить: "))
            k2 = str(input(f"Введи символ/слово, на который ты хочешь заменить: "))
            print("Результат: ", v2.replace(s2, k2))
        elif met == 3:
            v3 = str(input(f"Введи строку: "))
            s3 = str(input(f"Введи символ, количество которого в строке хочешь узнать: "))
            print("Результат: ", v3.count(s3))
        else:
            print("Ошибка")

    elif uroven == 3:
        print(f"Описание уровня:\nМетод 1: split() - Разделяет строку на список из нескольких строк по введненному разделителю.\nМетод 2: join() - Объединяет слова последовательности.\n")
        text3 = "1,2,3,4"
        print(f"Проведем тест на строке '{text3}':\nМетод 1: {text3.split(",")} <- Создается список из элементов, разделенных ','.\nМетод 2: {" ".join(text3)} <- Элементы строки склеиваются друг с другом пробелом.\n")
        met = int(input("Выбери метод: "))
        if met == 1:
            v1 = str(input(f"Введи строку: "))
            s1 = str(input(f"Введи знак, по которому хочешь разделить элементы и создать список: "))
            print("Результат: ", v1.split(s1))
        elif met == 2:
            v2 = str(input(f"Введи строку: "))
            s2 = str(input(f"Введи знак, по которому хочешь соединить элементы: "))
            print("Результат: ", s2.join(v2))
        else:
            print("Ошибка")

    elif uroven == 4:
        print(f"Описание уровня:\nМетод 1: isdigit() - проверяет все ли символы в строке являются цифрами (True/False)\nМетод 2: isalpha() - проверяет все ли символы являются буквами (True/False)\nМетод 3: strip() - убирает лишние пробелы или символы в начале и в конце строки.\n")
        text4 = " 1234*&%1$    "
        print(f"Проведем тест на строке '{text4}':\nМетод 1: {text4.isdigit()} - False, в строке не только цифры\nМетод 2: {text4.isalpha()} - False, в строке не только буквы\nМетод 3: {text4.strip()} - выводит готовую строку без лишних или введенных символов пробелов.\n")
        met = int(input("Выбери метод: "))
        if met == 1:
            v1 = str(input(f"Введи строку: "))
            print(f"Результат: ", v1.isdigit())
        elif met == 2:
            v2 = str(input(f"Введи строку: "))
            print(f"Результат: ", v2.isalpha())
        elif met == 3:
            v3 = str(input(f"Введи строку: "))
            s3 = str(input(f"Введи символ, который хочешь убрать (Enter - пробелы): "))
            print(f"Результат: ", v3.strip(s3))
        else:
            print(f"Ошибка")
    if uroven == 5:
        print(f"Описание уровня:\nДанный уровень 'очистит' вашу строку и приведет к нормальному виду, используя комбинацию из 1-4 уровней.\n")
        text5 = ".......pYtHon;is;AWESOME-------"
        step1 = text5.strip('.-')
        step2 = step1.replace(';', ' ')
        step3 = step2.capitalize()
        print(f"Проведем тест на строке '{text5}':\nШаг_1 (strip()): '{step1}' - Убрали точки и дефисы по краям.\nШаг_2 (replace()): '{step2}' - Заменили ненужные символы (;) на пробелы.\nШаг_3 (capitalize()): '{step3}' - Привели нормальному регистру.\n")
        v1 = str(input(f"Введи строку: "))
        print(f"Если какое-то дальнейшее изменение тебе не нужно, нажми Enter!")
        s1 = str(input(f"Введи символы, которые ты хочешь убрать с краев: "))
        if s1:
            v1 = v1.strip(s1)
        k1 = str(input(f"Введи символ, который хочешь заменить: "))
        if k1:
            n1 = str(input(f"Введи символ, на который хочешь заменить: "))
            v1 = v1.replace(k1, n1)
        print(f"Результат: ", v1.capitalize())